/**
 * Regular expressions
 * @author Laure ndoulou
 */

export const validFirstName = new RegExp(
    /^[a-zA-Z\-|ç|ï|î|ü|ê|ë|à|é|è]+[ \-']?[[a-zA-Z\-|ç|ï|î|ü|ê|ë|à|é|è]+[ \-']?]*[a-zA-Z\-|ç|ï|î|ü|ê|ë|à|é|è]+$/,
);

export const validLastName = new RegExp(
    /^[a-zA-Z\-|ç|ï|î|ü|ê|ë|à|é|è]+[ \-']?[[a-zA-Z\-|ç|ï|î|ü|ê|ë|à|é|è]+[ \-']?]*[a-zA-Z\-|ç|ï|î|ü|ê|ë|à|é|è]+$/,
);
export const validNumber = new RegExp(/^([0-9]{1,6})+.*?([a-zA-Z]{0,3})+$/,);
export const validStreet = new RegExp(/^[a-zA-Z0-9\-|ç|ï|î|ü|ê|ë|à|é|è]+[ \ ']?[[a-zA-Z0-9\-|ç|ï|î|ü|ê|ë|à|é|è]+[ \ ']?[[a-zA-Z0-9\-|ç|ï|î|ü|ê|ë|à|é|è]+[ \ ']?]*[a-zA-Z0-9\-|ç|ï|î|ü|ê|ë|à|é|è]+$/,
);
export const validZipcode = new RegExp(/^[a-zA-Z0-9\-|ç|ï|î|ü|ê|ë|à|é|è]+[ \ ']?[[a-zA-Z0-9\-|ç|ï|î|ü|ê|ë|à|é|è]+[ \ ']?]*[a-zA-Z0-9\-|ç|ï|î|ü|ê|ë|à|é|è]+$/,
);
export const validCity = new RegExp(/^[a-zA-Z0-9\-|ç|ï|î|ü|ê|ë|à|é|è]+[ \ ']?[[a-zA-Z0-9\-|ç|ï|î|ü|ê|ë|à|é|è]+[ \ ']?]*[a-zA-Z0-9\-|ç|ï|î|ü|ê|ë|à|é|è]+$/,
);
export const validCountry = new RegExp(/^[a-zA-Z0-9\-|ç|ï|î|ü|ê|ë|à|é|è]+[ \ ']?[[a-zA-Z0-9\-|ç|ï|î|ü|ê|ë|à|é|è]+[ \ ']?]*[a-zA-Z0-9\-|ç|ï|î|ü|ê|ë|à|é|è]+$/,
);
export const validPhoneNumber = new RegExp(/^[0-9]+$/);
export const validUsername = new RegExp(/^[a-zA-Z0-9\-|ç|ï|î|ü|ê|ë|à|é|è]+[ \ ']?[[a-zA-Z0-9\-|ç|ï|î|ü|ê|ë|à|é|è]+[ \ ']?]*[a-zA-Z0-9\-|ç|ï|î|ü|ê|ë|à|é|è]+$/,
);
export const validEmail = new RegExp(/^[a-zA-Z0-9._:$!%-]+@[a-zA-Z0-9.-]+.[a-zA-Z]$/);
export const validPassword = new RegExp(
    /^(?=.*\d)(?=.*[a-z])(?=.*[A-Z])(?=.*[-|+|!|?|*|$|&|#|~|@|%|_])([-|+|!|?|*|$|&|#|~|@|%|_\w]{8,15})$/,
);
export const validBirthDate = new RegExp(
    /^(?:(?:31(\/|-|\.)(?:0?[13578]|1[02]))\1|(?:(?:29|30)(\/|-|\.)(?:0?[13-9]|1[0-2])\2))(?:(?:1[6-9]|[2-9]\d)?\d{2})$|^(?:29(\/|-|\.)0?2\3(?:(?:(?:1[6-9]|[2-9]\d)?(?:0[48]|[2468][048]|[13579][26])|(?:(?:16|[2468][048]|[3579][26])00))))$|^(?:0?[1-9]|1\d|2[0-8])(\/|-|\.)(?:(?:0?[1-9])|(?:1[0-2]))\4(?:(?:1[6-9]|[2-9]\d)?\d{2})$/,
);



